//
//  Data.swift
//  ДЗ TextView + Button
//
//  Created by dream.one on 14.08.2020.
//  Copyright © 2020 Yura Fomin. All rights reserved.
//

import UIKit

class Data: UIViewController {

   let textOnView = """
   Последние слова Стива Джобса
   (основателя компании Apple)
   Он умер миллиардером в возрасте 56 лет
   от рака поджелудочной железы
   И вот его некоторые последние слова:
   
   «Я достиг пика успеха в деловом мире,
   в глазах других моя жизнь является сущностью успеха.
   
   Однако, кроме работы, у меня мало радости.
   В конце концов, богатство — это просто факт жизни,
   к которому я привык.
   
   В этот момент, когда я лежу в кровати больной
   и вспоминаю всю свою жизнь,
   я понимаю, что всё признание и богатство,
   которые у меня есть,
   бессмысленны и лишены высшего смысла
   перед лицом неминуемой смерти.
   
   Вы можете нанять кого-то,
   чтобы водить машину для Вас,
   зарабатывать деньги для Вас,
   но вы не сможете никого нанять за все Ваши деньги,
   чтобы он понёс эту болезнь вместо Вас.
   
   Можно найти и купить материальные вещи.
   Но есть одна вещь, которую нельзя найти и купить,
   когда она потеряна – нельзя купить «жизнь».
   
   Побалуйте себя хорошо.
   И уважайте других.
   
   Чем старше мы становимся, тем больше мы умнеем,
   и постепенно мы понимаем,
   что часы, которые стоят $30,
   и часы, которые стоят $300,
   показывают одно и тоже время.
   
   Будем ли мы носить с собой кошелек,
   который стоит 30$,
   или кошелек, который стоит 300$ —
   оба вмещают одинаковую сумму денег.
   
   Будем ли мы ездить на автомобиле
   стоимостью 150 000 долларов
   или на машине стоимостью 30 000 долларов —
   дорога и расстояние одинаковы,
   и мы достигаем того же места назначения.
   
   Если мы выпьем бутылку стоимостью 300 долларов
   или вино стоимостью 10 долларов,
   то «кайф» будет одинаковым.
   
   В доме, в котором ты живешь,
   площадью 300 кв. метров
   или 3000 квадратных метров –
   ты одинаково одинок.
   
   Ваше истинное внутреннее счастье
   исходит не из материальных вещей этого мира.
   
   Если вы летите в первом классе или эконом-классе,
   и если самолет падает, то ты падаешь вместе с ним.
   
   Итак ...
   Надеюсь, вы понимаете, что когда у вас есть друзья,
   или кто-то, с кем можно поговорить,
   то это настоящее счастье!
   
   Пять неоспоримых фактов:
   
   1. Не воспитывайте своих детей, чтобы они были богатыми.
   Воспитывайте их, чтобы они были счастливы.
   Поэтому, когда они вырастут,
   они будут знать ценность вещей, а не их цену.
   
   2. Ешьте еду как лекарство.
   В противном случае вы должны есть свое лекарство
   в качестве пищи.
   
   3. Те, кто вас любит, никогда не покинет вас,
   даже если у него есть 100% причин отказаться от Вас —
   он или она всегда найдет одну причину
   быть стойким и не оставить Вас.
   
   4. Существует большая разница между тем,
   чтобы быть человеком
   и тем, чтобы быть человечным.
   
   Если вы просто хотите идти быстро,
   идите в одиночку!
   Но если вы хотите уйти далеко,
   идите вместе!
   
   Шесть лучших врачей мира:
   
   1. Солнечный свет
   2. Отдых
   3. Спортивная зарядка
   4. Диета
   5. Уверенность в себе
   6. Друзья
   
   Держите их на всех этапах жизни
   и наслаждайтесь здоровой жизнью».
   
   (Стив Джобс)
   """

}
